Changed as per suggestion.

  # ibm_cis_origin_auth.tests will be created
  + resource "ibm_cis_origin_auth" "tests" {
      + auth_id     = (known after apply)
      + cert_id     = (known after apply)
      + **certificate = (sensitive value)**
      + cis_id      = "crn:v1:staging:public:internet-svcs-ci:global:a/01652b251c3ae2787110a995d8db0135:cc0a9aff-ae5f-40d7-b11d-c9a2d2c276a2::"
      + domain_id   = "feabea42a71e6fd976016b2efa297205"
      + enabled     = true
      + expires_on  = (known after apply)
      + hostname    = "darunya.austest-10.cistest-load.com"
      + id          = (known after apply)
      + level       = "hostname"
      + **private_key = (sensitive value)**
      + status      = (known after apply)
      + uploaded_on = (known after apply)
    }

FYI : @hkantare 